laplacianSnappyFoam_pipeCase/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 5.39e-7;

boundaryField
{
    topPatch
    {
        type            zeroGradient;
    }

    wall
    {
        type            epsilonWallFunction;
	value           $internalField;
    }

    bottomPatch
    {
        type            turbulentMixingLengthDissipationRateInlet;
	mixingLength	0.07;
	value		$internalField;
    }
}


// ************************************************************************* //
